_Rarzrabotki/Rarus/USO2/Documents/уатВводНачальныхПоказаний.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>уатВводНачальныхПоказаний</Name>
			<Comment>(уат)</Comment>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.уатСчетчикиТС</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписокТС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Спидометр</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТС</Name>
							<Comment>Транспортное средство</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ТранспортныеСредства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПоказанияСпидометра</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>11</v8:Digits>
									<v8:FractionDigits>1</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/уатТипыСчетчиковТС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>уатТипыСчетчиковТС</Name>
			<Comment>(уат)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Спидометр</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СчетчикМЧ</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Documents/уатВводНачальныхПоказаний/Ext/ManagerModule.bsl
// Инициализирует таблицы значений, содержащие данные табличных частей документа.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, СтруктураДополнительныеСвойства) Экспорт
	СформироватьТаблицуСчетчикиТС(ДокументСсылка, СтруктураДополнительныеСвойства);
КонецПроцедуры // ИнициализироватьДанныеДокумента()

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицуСчетчикиТС(ДокументСсылка, СтруктураДополнительныеСвойства)
	тблСчетчикиТС = Новый ТаблицаЗначений;
	тблСчетчикиТС.Колонки.Добавить("Регистратор");
	тблСчетчикиТС.Колонки.Добавить("Период");
	тблСчетчикиТС.Колонки.Добавить("ТС");
	тблСчетчикиТС.Колонки.Добавить("ТипСчетчика");
	тблСчетчикиТС.Колонки.Добавить("Значение");
	
	Для Каждого ТекСтрокаСпидометр Из ДокументСсылка.Спидометр Цикл
		Если ТекСтрокаСпидометр.ПоказанияСпидометра > 0 Тогда
			НоваяСтрока = тблСчетчикиТС.Добавить();
			НоваяСтрока.Период = ДокументСсылка.Дата;
			НоваяСтрока.Регистратор = ДокументСсылка;
			НоваяСтрока.ТС = ТекСтрокаСпидометр.ТС;
			Если ЗначениеЗаполнено(НоваяСтрока.ТС.уатМодель) И НоваяСтрока.ТС.уатМодель.НаличиеСпидометра > 0 Тогда
				НоваяСтрока.ТипСчетчика = Перечисления.уатТипыСчетчиковТС.Спидометр;
			Иначе
				НоваяСтрока.ТипСчетчика = Перечисления.уатТипыСчетчиковТС.СчетчикМЧ;
			КонецЕсли;	
			НоваяСтрока.Значение = ТекСтрокаСпидометр.ПоказанияСпидометра;
		КонецЕсли;	
	КонецЦикла;
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаСчетчиковТС", тблСчетчикиТС);
КонецПроцедуры // СформироватьТаблицуАгрегатыТС()

// Выполняет контроль возникновения отрицательных остатков.
//
Процедура ВыполнитьКонтроль(ДокументСсылка, ДополнительныеСвойства, Отказ, УдалениеПроведения = Ложь) Экспорт
	//Зарезервировано
КонецПроцедуры

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати – ТаблицаЗначений – состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	Заглушка = Истина;
КонецПроцедуры

// СтандартныеПодсистемы.ВерсионированиеОбъектов
// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
	Заглушка = Истина;
КонецПроцедуры
// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
